wms_mobile/src/Documents/итПриемка/итПриемка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итПриемка</name>
  <posting>Deny</posting>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПомарочныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеФизическогоНосителя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПомарочногоУчета</name>
    <attributes>
      <name>SSCC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/InformationRegisters/ИтЗадачиНаТСД/ИтЗадачиНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтЗадачиНаТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итНаборка</types>
      <types>DocumentRef.итОтгрузка</types>
      <types>DocumentRef.итПриемка</types>
      <types>DocumentRef.итЗадачиИнвентаризации</types>
      <types>DocumentRef.итПеремещение</types>
      <types>DocumentRef.итКонтрольнаяАгрегация</types>
      <types>DocumentRef.итРазмещение</types>
      <types>DocumentRef.итПроверка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wms_mobile/src/Documents/итПриемка/Forms/ФормаКомментарияПриемки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
ОповеститьОВыборе(Комментарий);	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдЗадачи") тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если  не Параметры.Свойство("ОбъектДокумента") тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;
ИдЗадачи=Параметры.ИдЗадачи;
ОбъектДокумента=Параметры.ОбъектДокумента;
ЗаполнитьЗначенияКомментарияЗадачи();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияКомментарияЗадачи()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ДополнительныеДанные КАК ДополнительныеДанные
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ДокументОснование = &ДокументОснование
		|	И ИтЗадачиНаТСД.ИдЗадачи = &ИдЗадачи";
	
	Запрос.УстановитьПараметр("ДокументОснование", ОбъектДокумента);
	Запрос.УстановитьПараметр("ИдЗадачи", ИдЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДополнительныеДанные=ВыборкаДетальныеЗаписи.ДополнительныеДанные.Получить();
		Если ТипЗнч(ДополнительныеДанные)=Тип("Структура") тогда
			Если ДополнительныеДанные.Свойство("Комментарий") тогда
				Комментарий=ДополнительныеДанные.Комментарий;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	КонецПроцедуры
